# coding=utf-8
import jieba.analyse

jieba.load_userdict('data/newWord.txt')
jieba.analyse.set_stop_words("data/stopWord.txt")
title = "卷积神经网络"
description = "卷积神经网络"
title_keys = jieba.lcut(title)
description_keys = jieba.lcut(description)
text1 = "k歌里别人选出一个2c马超擦伤自杀属于多个独立的分类欧基里德算式函数常常用于结构取值范围为任意数，基层卷积神经网络中每层卷积层有若干卷及单元组成每个选择单元的参数都是通过反向传播算法最优化得到的积运算律，cn其残局健都会周期性的插入花通常会分别作用于大学当前最常用形式，华会不断的减小数据的空间大小因此差参数的数量和其能量也会下降所为这在一定程度上也控制的功率和通常来说，输出最大值世界上这种机制能够有效的原因在于发现一个特征之后他的准确位置远不及他和其他特征的相对位置的关系重要，双曲正切函数或者c吗函数相比其他函数来说伟六函数正数鑫来这是因为它可以将神经网络的训练速度提升数倍，对于大型图像处理有出色表现拳击神经网络由一个或多个卷积层和顶端的全连接层对应经典的神经网络组成，同时也包括关联权重和差化层一结构式的天气神经网络能够利用输入数据的二维结构与其他深度学习结构相比，预测结果合成世界之间的差异它通常是网络的最后一次歌不同的算式函数适用于不同类型的任务比如交叉熵损失函数，有多种不同形式的非线性化函数二其中最大值华最为常见它是将食物的图像和矩形区域内的车，其实是使用较小的吃法滤镜甚至不再使用手册损失函数曾用于决定训练过程如何来惩罚网络，张强判定函数和正和神经网络的非线性特征而本身并不会改变卷积层事实上其他的一些还是乳液可以做用于增强网络的非线性特征，拳击少女网络在图像和语音识别方面能够给出更好的结果这模型也可以使用反向传播算法进行训练相比较其他深度千克声音，美国两个元素从图像还分数22的区块然后对每个数分钟的四周剪去最大值真相慧权少75%的数据量，是提取物的不同特征第一层卷积层可能只能提取一些低级的特征和边缘线条和角粉层次更多的网络坤，运动可以使金像视频视频分析发现为题的，3301，除了最大的也可以使用其他的吃法函数应用平军事化设置rl2范数吃法的过去平均数的使用，众泰t旭更复杂不错珍线性整流程线性整流程使用线性肿瘤作为这一层神经单元的积累函数，需要考虑的参数更少十成为一种颇具吸引力的深度学习的结构天气神经网络的结构包括，但是静由于最大十八大时间中的表现最好的平均法已经不太常用城崮快的减少的数据的大小，并不会对模型的泛化准确度造成显著影响说话诚实华试卷及英网络中的另一个重要的概念它实际上是一种形式的，剪辑神经网络是一种前馈神经网络她的人红神经元可以响应一部分覆盖范围内的周围"
text2 = "10,卷积神经网络,找个函数相比其他很出来说伟函数正数鑫来这是因为它可以将神经网络的训练速度提升数倍而并不会对模型的泛化准确度造成显著，卷积神经网络一种前馈神经网络她的人红神经元可以响应一部分覆盖范围内的作为党员，除了最大的也可以使用其他的吃法函数应用平军式化设置2l二范数执法的过去平均数的使用增强为广泛但是由于，关联权重和差化层这一结构是的卷积神经网络能够利用输入数据的二维结构与其他深度学习结构相比计算机网络在图像和语音识别方面能够给，每个单元的参数都是通过反向传播算法最优化得到的卷积运算的目的是提取输入的不同特征第一层卷积层可能只能提取一些低级的特征和边缘线条和角等层次，实话实话是娟侄女网络中的另一个重要的概念它实际上是一种形式的相册有多种不同形式的非线性，更好的结果追模型也可以使用反向传播算法进行训练相比较其他深度前馈神经网络卷积神经网络需要考虑的参数更少，甚至不再使用说话臭损失函数曾用于决定训练过程如何来惩罚网络的预测结果和正式结果之间的差异，自然语言处理药物发现围棋的，通常是网络的最后一次各种不同的损失函数适用于不同类型的任务比如交叉熵损失函数常常被用作k歌类别中选出一个2c吗交叉熵损失函数，嗨增强盘点函数和整个神经网络的非线性特征而本身并不会改变卷积层事实上其他的一些还是乳液可以做用于增强网络的非线性特征双曲正切函数，对于大型图像处理有出色表现卷积神经网络由一个或多个卷积层和顶端的全连接层对应经典的神经网络组成透视也包括，这在一定程度上也控制了过滤盒通常来说CNN的卷积层之间都慧周期性的插入华曾氏华通常会分别作用于我的大小，独立的分类欧几里得算是函数成常用于结构取值范围为任意实数的建议他的运动可以使景象识别视频分析，更多的网络从第几特征重叠提取更复杂不合身线性整流程线性整流层使用线性整流作为这一层神经单元的具体函数，之成为一种颇具吸引力的深度学习的结构天气曾经的王网络的结构包括卷积层卷积神经网络中每层卷积层有若干卷及单元组成，其中最大值华最为常见它是将食物的图像和矩形区域对每次输出最大值直接上这种机制能够有效的，当前最常用形式的是华测试美国两个元素从图像和分数22区块然后对每个数中的四各剪去最大值真相慧减少75%的数据量，云发现一个特征之后他的准确位置远不及他和其他特征的相对位置的关系重要笑话才会不断的减小数据的空间大小因此差参数的数量和质量，你说话的时间中的表现最好的平均值法已经不太常用有一句话曾过快的减少的数据的大小当前文件中的趋势是使用较小的磁化率"
keys_tfidf = jieba.analyse.tfidf(text1, topK=20, withWeight=True, allowPOS=('n', 'nz', 'nt', 'nr', 'ns', 'eng', 'nrt'))
keys_textrank = jieba.analyse.textrank(text1, topK=20, withWeight=True, allowPOS=('n', 'nz', 'nt', 'nr', 'ns', 'eng', 'nrt'))

result = []
for i in range(20):
    flag = 0
    for j in range(20):
        if keys_tfidf[i][0] == keys_textrank[j][0]:
            if keys_tfidf[i][0] in title_keys:
                result.append((keys_tfidf[i][0], (keys_tfidf[i][1]+keys_textrank[j][1])*1.5))
            elif keys_tfidf[i][0] in description_keys:
                result.append((keys_tfidf[i][0], (keys_tfidf[i][1] + keys_textrank[j][1]) * 1.2))
            else:
                result.append((keys_tfidf[i][0], keys_tfidf[i][1] + keys_textrank[j][1]))
            flag = 1
            break
    if flag == 0:
        if keys_tfidf[i][0] in title_keys:
            result.append((keys_tfidf[i][0], keys_tfidf[i][1] * 1.5))
        elif keys_tfidf[i][0] in description_keys:
            result.append((keys_tfidf[i][0], keys_tfidf[i][1] * 1.2))
        else:
            result.append(keys_tfidf[i])


result = sorted(result, key=lambda x: -x[1])

print(keys_tfidf)
print(keys_textrank)
print(result)
print(len(result))
